unit10/app/controllers/foster_parents_controller.rb

  def index
    @foster_parents = FosterParent.all
---
SELECT "foster_parents".* FROM "foster_parents"

  def new
    @foster_parent = FosterParent.new
    @pet = Pet.find(params[:pet_id].to_i)
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT 1  [["id", "9"]]

  def create
    @foster_parent = FosterParent.new(foster_parent_params)
    @pet = Pet.find(foster_parent_params[:pet_id].to_i)
    @pet.update_attribute(:status, "Fostered")
    respond_to do |format|
      if @foster_parent.save
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT 1  [["id", 0]]
UPDATE "pets" SET "status" = ?, "updated_at" = ? WHERE "pets"."id" = 9  [["status", "Fostered"], ["updated_at", Tue, 25 Mar 2014 05:01:17 UTC +00:00]]
INSERT INTO "foster_parents" ("address", "created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", "I LIVE HERE"], ["created_at", Wed, 19 Feb 2014 06:26:59 UTC +00:00], ["email", "hi@email.com"], ["name", "Nastia "], ["updated_at", Wed, 19 Feb 2014 06:26:59 UTC +00:00]]

  def destroy
    @foster_parent.destroy
---
DELETE FROM "foster_parents" WHERE "foster_parents"."id" = ?  [["id", 1]]

    def set_foster_parent
      @foster_parent = FosterParent.find(params[:id])
---
SELECT "foster_parents".* FROM "foster_parents" WHERE "foster_parents"."id" = ? LIMIT 1  [["id", "980190962"]]