unit12/app/controllers/foster_controller.rb

  def index
    @pets = Pet.where(status: 'Available').order(:name).all
---
SELECT "pets".* FROM "pets" WHERE "pets"."status" = 'Available' ORDER BY "pets"."name" ASC

  def agreement
    @pet = Pet.find(params[:pet_id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? ORDER BY "pets"."id" ASC LIMIT 1  [["id", 1]]