unit12/app/controllers/line_pets_controller.rb

  def index
    @line_pets = LinePet.all
---
SELECT "line_pets".* FROM "line_pets"

  def create
    pet = Pet.find(params[:pet_id])
    @line_pet = @consider.add_pet(pet.id)

    respond_to do |format|
      if @line_pet.save
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? ORDER BY "pets"."id" ASC LIMIT 1  [["id", 8]]
INSERT INTO "considers" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Wed, 19 Feb 2014 01:40:59 UTC +00:00], ["updated_at", Wed, 19 Feb 2014 01:40:59 UTC +00:00]]
INSERT INTO "line_pets" ("consider_id", "created_at", "pet_id", "updated_at") VALUES (?, ?, ?, ?)  [["consider_id", 2], ["created_at", Wed, 19 Feb 2014 01:40:59 UTC +00:00], ["pet_id", 1], ["updated_at", Wed, 19 Feb 2014 01:40:59 UTC +00:00]]

    def set_line_pet
      @line_pet = LinePet.find(params[:id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? ORDER BY "pets"."id" ASC LIMIT 1  [["id", 1]]