unit12/app/controllers/pets_controller.rb

  def index
    @pets = Pet.order(sort_column + " " + sort_direction)
---
SELECT "pets".* FROM "pets" ORDER BY breed desc

  def create
    @pet = Pet.new(pet_params)

    respond_to do |format|
      if @pet.save
---
INSERT INTO "pets" ("age", "breed", "created_at", "habits", "image_url", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @pet.update(pet_params)
---
UPDATE "pets" SET "name" = ?, "habits" = ?, "updated_at" = ? WHERE "pets"."id" = 14  [["name", "Ruffelled Crow"], ["habits", "Leads his life by the inspirational Russell Crowe"], ["updated_at", Wed, 09 Apr 2014 04:20:19 UTC +00:00]]