unit12/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.update_attribute(:isadmin, 0)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "crypted_password", "isadmin", "salt", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if user_params[:isadmin] or @user.update(user_params)
---
UPDATE "users" SET "username" = ?, "salt" = ?, "crypted_password" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["username", "drew"], ["salt", "SKw3PEhdzAWKcDX3kPSz"], ["crypted_password", "$2a$10$k8Q6th3SC/Vt1PONkVa6pOKRiaQPU3hiVTqHmue5iHN8aVktHpm12"], ["updated_at", Tue, 08 Apr 2014 23:13:55 UTC +00:00]]