unit12/app/views/foster/index.html.erb

<table>
	<% cache ['foster', Pet.latest] do %>
---
SELECT "pets".* FROM "pets" ORDER BY "pets"."updated_at" DESC LIMIT 1